export default function Result({ans}){
  const s = ans.reduce((a,b)=>a+b,0);
  let cls="result-green", txt="🟢 آمن مبدئيًا";
  if(s>10){cls="result-yellow";txt="🟡 يحتاج مراجعة هندسية";}
  if(s>18){cls="result-red";txt="🔴 خطر مرتفع";}

  return(
    <section className="card">
      <h2>النتيجة</h2>
      <h3 className={cls}>{txt}</h3>
      <p>
        هذه النتيجة <strong>استرشادية فقط</strong> ولا تُعد تقريرًا هندسيًا
        ولا تُغني عن الفحص الموقعي.
      </p>
      <h4>توصيات عملية:</h4>
      <ul>
        <li>مراجعة مهندس إنشائي مختص</li>
        <li>تجنب أي تعديلات بدون دراسة</li>
        <li>مراقبة التشققات وأي تغيرات</li>
      </ul>
    </section>
  );
}
